---
kind: property
id: P:Autodesk.Revit.DB.Frame.BasisY
source: html/129f694e-8943-2999-3d2f-25d19a3bb9f2.htm
---
# Autodesk.Revit.DB.Frame.BasisY Property

The second basis vector of the frame.

## Syntax (C#)
```csharp
public XYZ BasisY { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null